benchmark_results_replicated/20260803_085536/analysis/rep20/run/go_heavy_mock_c10/wrk_output.txt
Running 1m test @ http://localhost:8080/days-since-heavy-mock
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78ms    1.18ms  13.14ms   72.80%
    Req/Sec     1.16k    83.29     1.51k    67.58%
  Latency Distribution
     50%    1.52ms
     75%    2.38ms
     90%    3.35ms
     99%    5.63ms
  276713 requests in 1.00m, 38.22MB read
Requests/sec:   4610.14
Transfer/sec:    651.99KB
P95: 4068
P99: 5630